Repository: yunusolcar/python-docs-tr
Catalog: library/intro.po
Languages: tr

source: Introduction
tr: Giriş

source: The "Python library" contains several different kinds of components.
tr: "Python kütüphanesi" birkaç farklı türde bileşen içerir.

source: It contains data types that would normally be considered part of the "core" of a language, such as numbers and lists. For these types, the Python language core defines the form of literals and places some constraints on their semantics, but does not fully define the semantics. (On the other hand, the language core does define syntactic properties like the spelling and priorities of operators.)
tr: Sayılar ve listeler gibi normalde bir dilin "çekirdeğinin" parçası olarak kabul edilecek veri türlerini içerir. Bu türler için, Python dil çekirdeği değişmezlerin biçimini tanımlar ve anlamları üzerine bazı kısıtlamalar koyar, ancak anlamları tam olarak tanımlamaz. (Öte yandan, dil çekirdeği operatörlerin yazımı ve öncelikleri gibi sözdizimsel özellikleri tanımlar).

source: The library also contains built-in functions and exceptions --- objects that can be used by all Python code without the need of an :keyword:`import` statement. Some of these are defined by the core language, but many are not essential for the core semantics and are only described here.
tr: Kütüphane ayrıca yerleşik fonksiyonlar ve istisnalar da içerir --- bir :keyword:`import` deyimine ihtiyaç duymadan tüm Python kodları tarafından kullanılabilen nesneler. Bunlardan bazıları çekirdek dil tarafından tanımlanmıştır, ancak çoğu çekirdek semantiği için gerekli değildir ve burada sadece açıklanmıştır.

source: The bulk of the library, however, consists of a collection of modules. There are many ways to dissect this collection. Some modules are written in C and built in to the Python interpreter; others are written in Python and imported in source form. Some modules provide interfaces that are highly specific to Python, like printing a stack trace; some provide interfaces that are specific to particular operating systems, such as access to specific hardware; others provide interfaces that are specific to a particular application domain, like the World Wide Web. Some modules are available in all versions and ports of Python; others are only available when the underlying system supports or requires them; yet others are available only when a particular configuration option was chosen at the time when Python was compiled and installed.
tr: Bununla birlikte, kütüphanenin büyük kısmı bir modül koleksiyonundan oluşur. Bu koleksiyonu incelemenin birçok yolu vardır. Bazı modüller C dilinde yazılmış ve Python yorumlayıcısına yerleştirilmiştir; diğerleri Python dilinde yazılmış ve kaynak biçiminde içe aktarılmıştır. Bazı modüller, yığın izlemesi yazdırma gibi Python'a özgü arayüzler sağlar; bazıları belirli donanımlara erişim gibi belirli işletim sistemlerine özgü arayüzler sağlar; diğerleri World Wide Web gibi belirli bir uygulama alanına özgü arayüzler sağlar. Bazı modüller Python'un tüm sürümlerinde ve portlarında mevcuttur; diğerleri yalnızca temel sistem bunları desteklediğinde veya gerektirdiğinde kullanılabilir; ancak diğerleri yalnızca Python derlendiğinde ve yüklendiğinde belirli bir yapılandırma seçeneği seçildiğinde kullanılabilir.

source: This manual is organized "from the inside out:" it first describes the built-in functions, data types and exceptions, and finally the modules, grouped in chapters of related modules.
tr: Bu kılavuz "içten dışa doğru" düzenlenmiştir: ilk olarak yerleşik fonksiyonlar, veri türleri ve istisnalar ve son olarak ilgili modüllerin bölümlerinde gruplandırılmış modüller açıklanmaktadır.

source: This means that if you start reading this manual from the start, and skip to the next chapter when you get bored, you will get a reasonable overview of the available modules and application areas that are supported by the Python library. Of course, you don't *have* to read it like a novel --- you can also browse the table of contents (in front of the manual), or look for a specific function, module or term in the index (in the back). And finally, if you enjoy learning about random subjects, you choose a random page number (see module :mod:`random`) and read a section or two. Regardless of the order in which you read the sections of this manual, it helps to start with chapter :ref:`built-in-funcs`, as the remainder of the manual assumes familiarity with this material.
tr: Bu, bu kılavuzu en baştan okumaya başlarsanız ve sıkıldığınızda bir sonraki bölüme atlarsanız, Python kütüphanesi tarafından desteklenen mevcut modüller ve uygulama alanları hakkında makul bir genel bakış elde edeceğiniz anlamına gelir. Elbette bunu bir roman gibi okumak zorunda değilsiniz --- içindekiler tablosuna da göz atabilir (kılavuzun önünde) veya dizinde (arkada) belirli bir fonksiyonu, modülü veya terimi arayabilirsiniz. Ve son olarak, rastgele konular hakkında bilgi edinmekten hoşlanıyorsanız, rastgele bir sayfa numarası seçip (bkz. modül :mod:`random`) bir ya da iki bölüm okuyabilirsiniz. Bu kılavuzun bölümlerini okuma sıranız ne olursa olsun, kılavuzun geri kalanı bu materyale aşina olduğunuzu varsaydığından, bölüm :ref:`built-in-funcs` ile başlamanıza yardımcı olur.

source: Let the show begin!
tr: Gösteri başlasın!

source: Notes on availability
tr: Kullanılabilirlik hakkında notlar

source: An "Availability: Unix" note means that this function is commonly found on Unix systems. It does not make any claims about its existence on a specific operating system.
tr: "Kullanılabilirlik: Unix" notu, bu fonksiyonun Unix sistemlerinde yaygın olarak bulunduğu anlamına gelir. Belirli bir işletim sistemindeki varlığı hakkında herhangi bir iddiada bulunmaz.

source: If not separately noted, all functions that claim "Availability: Unix" are supported on macOS, which builds on a Unix core.
tr: Ayrı olarak belirtilmediği takdirde, "Kullanılabilirlik: Unix" yazan tüm fonksiyonlar, Unix çekirdeği üzerine inşa edilen macOS üzerinde desteklenmektedir.

source: If an availability note contains both a minimum Kernel version and a minimum libc version, then both conditions must hold. For example a feature with note *Availability: Linux >= 3.17 with glibc >= 2.27* requires both Linux 3.17 or newer and glibc 2.27 or newer.
tr: Bir kullanılabilirlik notu hem minimum Çekirdek(Kernel) sürümü hem de minimum libc sürümü içeriyorsa, her iki koşul da geçerli olmalıdır. Örneğin *Availability: Linux >= 3.17 with glibc >= 2.27* notuna sahip bir özellik için hem Linux 3.17 veya daha yeni hem de glibc 2.27 veya daha yeni olması gerekir.

source: WebAssembly platforms
tr: WebAssembly platformları

source: The `WebAssembly`_ platforms ``wasm32-emscripten`` (`Emscripten`_) and ``wasm32-wasi`` (`WASI`_) provide a subset of POSIX APIs. WebAssembly runtimes and browsers are sandboxed and have limited access to the host and external resources. Any Python standard library module that uses processes, threading, networking, signals, or other forms of inter-process communication (IPC), is either not available or may not work as on other Unix-like systems. File I/O, file system, and Unix permission-related functions are restricted, too. Emscripten does not permit blocking I/O. Other blocking operations like :func:`~time.sleep` block the browser event loop.
tr: WebAssembly`_ platformları ``wasm32-emscripten`` (`Emscripten`_) ve ``wasm32-wasi`` (`WASI`_) POSIX API`lerinin bir alt kümesini sağlar. WebAssembly çalışma zamanları ve tarayıcıları korumalıdır ve ana bilgisayara ve harici kaynaklara sınırlı erişime sahiptir. Süreçler, iş parçacığı, ağ, sinyaller veya diğer süreçler arası iletişim (IPC) biçimlerini kullanan herhangi bir Python standart kütüphane modülü ya mevcut değildir ya da diğer Unix benzeri sistemlerde olduğu gibi çalışmayabilir. Dosya I/O, dosya sistemi ve Unix izinleriyle ilgili işlevler de kısıtlanmıştır. Emscripten bloklama I/O'ye izin vermez. :func:`~time.sleep` gibi diğer engelleme işlemleri tarayıcı olay döngüsünü engeller.

source: The properties and behavior of Python on WebAssembly platforms depend on the `Emscripten`_-SDK or `WASI`_-SDK version, WASM runtimes (browser, NodeJS, `wasmtime`_), and Python build time flags. WebAssembly, Emscripten, and WASI are evolving standards; some features like networking may be supported in the future.
tr: Python'un WebAssembly platformlarındaki özellikleri ve davranışı `Emscripten`_-SDK veya `WASI`_-SDK sürümüne, WASM çalışma zamanlarına (tarayıcı, NodeJS, `wasmtime`_) ve Python derleme zamanı bayraklarına(build time flags) bağlıdır. WebAssembly, Emscripten ve WASI gelişmekte olan standartlardır; ağ oluşturma gibi bazı özellikler gelecekte desteklenebilir.

source: For Python in the browser, users should consider `Pyodide`_ or `PyScript`_. PyScript is built on top of Pyodide, which itself is built on top of CPython and Emscripten. Pyodide provides access to browsers' JavaScript and DOM APIs as well as limited networking capabilities with JavaScript's ``XMLHttpRequest`` and ``Fetch`` APIs.
tr: Tarayıcıda Python için kullanıcılar `Pyodide`_ veya `PyScript`_'i düşünmelidir. PyScript, kendisi de CPython ve Emscripten üzerine inşa edilmiş olan Pyodide üzerine kurulmuştur. Pyodide, tarayıcıların JavaScript ve DOM API'lerine erişimin yanı sıra JavaScript'in ``XMLHttpRequest`` ve ``Fetch`` API'leri ile sınırlı ağ yetenekleri sağlar.

source: Process-related APIs are not available or always fail with an error. That includes APIs that spawn new processes (:func:`~os.fork`, :func:`~os.execve`), wait for processes (:func:`~os.waitpid`), send signals (:func:`~os.kill`), or otherwise interact with processes. The :mod:`subprocess` is importable but does not work.
tr: Süreçle ilgili API'ler kullanılamaz veya her zaman bir hata ile başarısız olur. Bu, yeni süreçler oluşturan (:func:`~os.fork`, :func:`~os.execve`), süreçleri bekleyen (:func:`~os.waitpid`), sinyal gönderen (:func:`~os.kill`) veya süreçlerle başka şekilde etkileşime giren API'leri içerir. :mod:`subprocess` içe aktarılabilir ancak çalışmaz.

source: The :mod:`socket` module is available, but is limited and behaves differently from other platforms. On Emscripten, sockets are always non-blocking and require additional JavaScript code and helpers on the server to proxy TCP through WebSockets; see `Emscripten Networking`_ for more information. WASI snapshot preview 1 only permits sockets from an existing file descriptor.
tr: :mod:`socket` modülü mevcuttur, ancak sınırlıdır ve diğer platformlardan farklı davranır. Emscripten üzerinde, soketler her zaman bloklama yapmaz ve WebSockets aracılığıyla TCP'yi proxy'lemek için sunucuda ek JavaScript kodu ve yardımcılar gerektirir; daha fazla bilgi için `Emscripten Networking`_ bölümüne bakın. WASI anlık görüntü önizleme 1, yalnızca mevcut bir dosya tanımlayıcısından soketlere izin verir.

source: Some functions are stubs that either don't do anything and always return hardcoded values.
tr: Bazı fonksiyonlar hiçbir şey yapmayan ve her zaman sabit kodlanmış değerler döndüren taslaklardır.

source: Functions related to file descriptors, file permissions, file ownership, and links are limited and don't support some operations. For example, WASI does not permit symlinks with absolute file names.
tr: Dosya tanımlayıcıları, dosya izinleri, dosya sahipliği ve bağlantılarla ilgili işlevler sınırlıdır ve bazı işlemleri desteklemez. Örneğin, WASI mutlak dosya adlarıyla ortak bağlantılara izin vermez.
